In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame(np.arange(10).reshape(2,5))

In [3]:
df1

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [4]:
df2 = pd.read_csv("inputData/bc_data.csv")

In [5]:
df2.shape

(569, 32)

In [6]:
df2 = df2[["id","diagnosis","area_mean"]]

In [7]:
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [8]:
df2.index

RangeIndex(start=0, stop=569, step=1)

In [9]:
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [10]:
df2.columns

Index(['id', 'diagnosis', 'area_mean'], dtype='object')

In [11]:
df2.columns.size

3

In [12]:
df2.shape

(569, 3)

In [13]:
df2.shape[0]

569

In [14]:
df2.shape[1]

3

In [15]:
df2["id"].head()

0      842302
1      842517
2    84300903
3    84348301
4    84358402
Name: id, dtype: int64

In [16]:
df2.id.head()

0      842302
1      842517
2    84300903
3    84348301
4    84358402
Name: id, dtype: int64

In [17]:
df2["id"][2]

84300903

In [18]:
df2.id[2]

84300903

In [19]:
df2["id"][2:4]

2    84300903
3    84348301
Name: id, dtype: int64

In [41]:
df2.iloc[[2,5],[0,2]]

         id  area_mean
2  84300903     1203.0
5    843786      477.1

In [35]:
df2[["area_mean","id"]].head()

   area_mean        id
0     1001.0    842302
1     1326.0    842517
2     1203.0  84300903
3      386.1  84348301
4     1297.0  84358402

## 1.4index操作

In [36]:
df2.index

RangeIndex(start=0, stop=569, step=1)

In [42]:
df2.columns

Index(['id', 'diagnosis', 'area_mean'], dtype='object')

In [43]:
df2["id"].head()

0      842302
1      842517
2    84300903
3    84348301
4    84358402
Name: id, dtype: int64

In [49]:
df2.reindex(index=["1","2","3"],columns=["1","2","3"])#改变已有行列的顺序，不能改变索引
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [50]:
df2.reindex(index=[2,3,1],columns=["diagnosis","id","area_mean"])

  diagnosis        id  area_mean
2         M  84300903     1203.0
3         M  84348301      386.1
1         M    842517     1326.0

In [52]:
df3 = df2.reindex(index=[2,3,1],columns=["diagnosis","id","area_mean","MyNewColumn"],fill_value=10)
df3

  diagnosis        id  area_mean  MyNewColumn
2         M  84300903     1203.0           10
3         M  84348301      386.1           10
1         M    842517     1326.0           10

In [53]:
df2 = df2[["id","diagnosis","area_mean"]]
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

## 1.5删除或过滤行列

In [58]:
df2.drop("id",axis=1).head()

  diagnosis  area_mean
0         M     1001.0
1         M     1326.0
2         M     1203.0
3         M      386.1
4         M     1297.0

In [85]:
df2 = pd.read_csv("inputData/bc_data.csv")

In [81]:
df2 = df2[["id","diagnosis","area_mean"]]
df2.drop([3,4],inplace=False)
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [86]:
df2 = df2[["id","diagnosis","area_mean"]]
del df2["area_mean"]

In [87]:
df2.head()

         id diagnosis
0    842302         M
1    842517         M
2  84300903         M
3  84348301         M
4  84358402         M

In [121]:
df2 = pd.read_csv("inputData/bc_data.csv")
df2 = df2[["id","diagnosis","area_mean"]]

In [90]:
df2.drop(["id","diagnosis"],axis=1,inplace=False)
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [91]:
df2.drop(["id","diagnosis"],axis=1,inplace=True)
df2.head()

   area_mean
0     1001.0
1     1326.0
2     1203.0
3      386.1
4     1297.0

In [93]:
df2[df2.area_mean > 1000].head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
4  84358402         M     1297.0
6    844359         M     1040.0

In [96]:
df2[df2.area_mean > 1000][["id","diagnosis"]].head()

         id diagnosis
0    842302         M
1    842517         M
2  84300903         M
4  84358402         M
6    844359         M

## 1.6算数运算

In [97]:
df4 = pd.DataFrame(np.arange(6).reshape(2,3))

In [98]:
df4

   0  1  2
0  0  1  2
1  3  4  5

In [99]:
df5 = pd.DataFrame(np.arange(10).reshape(2,5))
df5

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [101]:
df4 + df5

   0   1   2   3   4
0  0   2   4 NaN NaN
1  8  10  12 NaN NaN

In [106]:
df6 = df4.add(df5,fill_value=10)

In [107]:
df6

   0   1   2     3     4
0  0   2   4  13.0  14.0
1  8  10  12  18.0  19.0

In [108]:
s1 = pd.Series(np.arange(3))
s1

0    0
1    1
2    2
dtype: int32

In [109]:
df6 - s1

     0    1     2   3   4
0  0.0  1.0   2.0 NaN NaN
1  8.0  9.0  10.0 NaN NaN

In [110]:
df5 = pd.DataFrame(np.arange(10).reshape(2,5))
df5

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [111]:
df5 - s1

     0    1    2   3   4
0  0.0  0.0  0.0 NaN NaN
1  5.0  5.0  5.0 NaN NaN

In [113]:
df5.sub(s1,axis=1)

     0    1    2   3   4
0  0.0  0.0  0.0 NaN NaN
1  5.0  5.0  5.0 NaN NaN

In [114]:
df5.sub(s1,axis=0)

     0    1    2    3    4
0  0.0  1.0  2.0  3.0  4.0
1  4.0  5.0  6.0  7.0  8.0
2  NaN  NaN  NaN  NaN  NaN

In [115]:
df7 = pd.DataFrame(np.arange(20).reshape(4,5))
df7

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [116]:
df7 +2

    0   1   2   3   4
0   2   3   4   5   6
1   7   8   9  10  11
2  12  13  14  15  16
3  17  18  19  20  21

In [119]:
df7.rolling(2).sum()

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1   5.0   7.0   9.0  11.0  13.0
2  15.0  17.0  19.0  21.0  23.0
3  25.0  27.0  29.0  31.0  33.0

In [120]:
df7.rolling(2,axis=1).sum()

    0     1     2     3     4
0 NaN   1.0   3.0   5.0   7.0
1 NaN  11.0  13.0  15.0  17.0
2 NaN  21.0  23.0  25.0  27.0
3 NaN  31.0  33.0  35.0  37.0

In [122]:
df2.head().T

                0       1         2         3         4
id         842302  842517  84300903  84348301  84358402
diagnosis       M       M         M         M         M
area_mean    1001    1326      1203     386.1      1297

## 1.7大小的比较运算

In [123]:
df6

   0   1   2     3     4
0  0   2   4  13.0  14.0
1  8  10  12  18.0  19.0

df6 > 5

In [126]:
df6 > s1

       0     1     2      3      4
0  False  True  True  False  False
1   True  True  True  False  False

## 1.8统计分析

In [1]:
import numpy as np
import pandas as pd
df2 = pd.read_csv("inputData/bc_data.csv")

In [3]:
df2  = df2[["id","diagnosis","area_mean"]]

In [4]:
df2.describe()

                 id    area_mean
count  5.690000e+02   569.000000
mean   3.037183e+07   654.889104
std    1.250206e+08   351.914129
min    8.670000e+03   143.500000
25%    8.692180e+05   420.300000
50%    9.060240e+05   551.100000
75%    8.813129e+06   782.700000
max    9.113205e+08  2501.000000

In [5]:
dt = df2[df2.diagnosis == "M"]

In [7]:
dt.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [8]:
dt.tail()

         id diagnosis  area_mean
563  926125         M     1347.0
564  926424         M     1479.0
565  926682         M     1261.0
566  926954         M      858.1
567  927241         M     1265.0

In [9]:
df2[df2.diagnosis == "M"].count()

id           212
diagnosis    212
area_mean    212
dtype: int64

## 1.9排序

In [10]:
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [13]:
df2.sort_values(by="area_mean",axis=0,ascending=True).head()

           id diagnosis  area_mean
101    862722         B      143.5
539    921362         B      170.4
538    921092         B      178.8
568     92751         B      181.0
46   85713702         B      201.9

In [14]:
df2.sort_index(axis=1).head(3)

   area_mean diagnosis        id
0     1001.0         M    842302
1     1326.0         M    842517
2     1203.0         M  84300903

In [17]:
df2.sort_index(axis=0,ascending=False).head()

         id diagnosis  area_mean
568   92751         B      181.0
567  927241         M     1265.0
566  926954         M      858.1
565  926682         M     1261.0
564  926424         M     1479.0

## 1.10导入导出

In [18]:
df2.head().to_csv("df2.csv")

In [19]:
df3 = pd.read_csv("df2.csv")

In [20]:
df3.head()

   Unnamed: 0        id diagnosis  area_mean
0           0    842302         M     1001.0
1           1    842517         M     1326.0
2           2  84300903         M     1203.0
3           3  84348301         M      386.1
4           4  84358402         M     1297.0

In [22]:
df3.drop("Unnamed: 0",axis=1)

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [24]:
df2.head().to_excel("df3.xls")
df3 = pd.read_excel("df3.xls")
df3

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

## 1.11缺失数据的处理

In [25]:
df3.empty

False

In [26]:
np.nan + 1

nan

In [27]:
A = pd.DataFrame(np.array([10,10,20,20]).reshape(2,2),columns=list("ab"),index=list("SW"))
A

    a   b
S  10  10
W  20  20

In [28]:
B =  pd.DataFrame(np.array([1,1,1,2,2,2,3,3,3]).reshape(3,3),columns=list("abc"),index=list("SWT"))

In [29]:
B

   a  b  c
S  1  1  1
W  2  2  2
T  3  3  3

In [30]:
C = A + B

In [31]:
C

      a     b   c
S  11.0  11.0 NaN
T   NaN   NaN NaN
W  22.0  22.0 NaN

In [34]:
A.add(B,fill_value=0)

      a     b    c
S  11.0  11.0  1.0
T   3.0   3.0  3.0
W  22.0  22.0  2.0

In [36]:
A.add(B,fill_value=A.stack().mean())

      a     b     c
S  11.0  11.0  16.0
T  18.0  18.0  18.0
W  22.0  22.0  17.0

In [38]:
A.stack().mean()

15.0

In [39]:
C

      a     b   c
S  11.0  11.0 NaN
T   NaN   NaN NaN
W  22.0  22.0 NaN

In [40]:
C.isnull()

       a      b     c
S  False  False  True
T   True   True  True
W  False  False  True

In [41]:
C.notnull()

       a      b      c
S   True   True  False
T  False  False  False
W   True   True  False

In [42]:
C.dropna(axis="index")

Empty DataFrame
Columns: [a, b, c]
Index: []

In [43]:
C.fillna(0)

      a     b    c
S  11.0  11.0  0.0
T   0.0   0.0  0.0
W  22.0  22.0  0.0

In [44]:
C.fillna(method="ffill")

      a     b   c
S  11.0  11.0 NaN
T  11.0  11.0 NaN
W  22.0  22.0 NaN

In [45]:
C.fillna(method="bfill")

      a     b   c
S  11.0  11.0 NaN
T  22.0  22.0 NaN
W  22.0  22.0 NaN

In [46]:
C.fillna(method="ffill",axis=1)

      a     b     c
S  11.0  11.0  11.0
T   NaN   NaN   NaN
W  22.0  22.0  22.0

## 1.12分组统计

In [47]:
df2 = pd.read_csv("inputData/bc_data.csv")

In [48]:
df2 = df2[["id","diagnosis","area_mean"]]

In [49]:
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [50]:
df2.groupby("diagnosis")["area_mean"].mean()

diagnosis
B    462.790196
M    978.376415
Name: area_mean, dtype: float64

In [52]:
df2.groupby("diagnosis")["area_mean"].aggregate(["mean","sum"]).unstack()

      diagnosis
mean  B               462.790196
      M               978.376415
sum   B            165216.100000
      M            207415.800000
dtype: float64

In [54]:
df2.groupby("diagnosis")["area_mean"].aggregate(["mean","sum","max",np.median]).unstack()

        diagnosis
mean    B               462.790196
        M               978.376415
sum     B            165216.100000
        M            207415.800000
max     B               992.100000
        M              2501.000000
median  B               458.400000
        M               932.000000
dtype: float64

In [57]:
def myfunc(x):
    x["area_mean"] /= x["area_mean"].sum()
    return x

In [58]:
df2.groupby("diagnosis").apply(myfunc).head()

         id diagnosis  area_mean
0    842302         M   0.004826
1    842517         M   0.006393
2  84300903         M   0.005800
3  84348301         M   0.001861
4  84358402         M   0.006253